IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28003x_epwm_xbar_regs.xml
	<register id="TRIP7MUX16TO31CFG" width="32" page="1" offset="0xa" internal="0" description="ePWM XBAR Mux Configuration for TRIP7">
		<bitfield id="MUX16" description="Mux16 Configuration for TRIP7 of EPWM-XBAR" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="MUX17" description="Mux17 Configuration for TRIP7 of EPWM-XBAR" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="MUX18" description="Mux18 Configuration for TRIP7 of EPWM-XBAR" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="MUX19" description="Mux19 Configuration for TRIP7 of EPWM-XBAR" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="MUX20" description="Mux20 Configuration for TRIP7 of EPWM-XBAR" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="MUX21" description="Mux21 Configuration for TRIP7 of EPWM-XBAR" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="MUX22" description="Mux22 Configuration for TRIP7 of EPWM-XBAR" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="MUX23" description="Mux23 Configuration for TRIP7 of EPWM-XBAR" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="MUX24" description="Mux24 Configuration for TRIP7 of EPWM-XBAR" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="MUX25" description="Mux25 Configuration for TRIP7 of EPWM-XBAR" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="MUX26" description="Mux26 Configuration for TRIP7 of EPWM-XBAR" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="MUX27" description="Mux27 Configuration for TRIP7 of EPWM-XBAR" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="MUX28" description="Mux28 Configuration for TRIP7 of EPWM-XBAR" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="MUX29" description="Mux29 Configuration for TRIP7 of EPWM-XBAR" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="MUX30" description="Mux30 Configuration for TRIP7 of EPWM-XBAR" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="MUX31" description="Mux31 Configuration for TRIP7 of EPWM-XBAR" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="TRIP8MUX0TO15CFG" width="32" page="1" offset="0xc" internal="0" description="ePWM XBAR Mux Configuration for TRIP8">
		<bitfield id="MUX0" description="Mux0 Configuration for TRIP8 of EPWM-XBAR" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="MUX1" description="Mux1 Configuration for TRIP8 of EPWM-XBAR" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="MUX2" description="Mux2 Configuration for TRIP8 of EPWM-XBAR" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="MUX3" description="Mux3 Configuration for TRIP8 of EPWM-XBAR" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="MUX4" description="Mux4 Configuration for TRIP8 of EPWM-XBAR" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="MUX5" description="Mux5 Configuration for TRIP8 of EPWM-XBAR" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="MUX6" description="Mux6 Configuration for TRIP8 of EPWM-XBAR" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="MUX7" description="Mux7 Configuration for TRIP8 of EPWM-XBAR" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="MUX8" description="Mux8 Configuration for TRIP8 of EPWM-XBAR" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="MUX9" description="Mux9 Configuration for TRIP8 of EPWM-XBAR" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="MUX10" description="Mux10 Configuration for TRIP8 of EPWM-XBAR" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="MUX11" description="Mux11 Configuration for TRIP8 of EPWM-XBAR" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="MUX12" description="Mux12 Configuration for TRIP8 of EPWM-XBAR" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="MUX13" description="Mux13 Configuration for TRIP8 of EPWM-XBAR" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="MUX14" description="Mux14 Configuration for TRIP8 of EPWM-XBAR" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="MUX15" description="Mux15 Configuration for TRIP8 of EPWM-XBAR" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="TRIP8MUX16TO31CFG" width="32" page="1" offset="0xe" internal="0" description="ePWM XBAR Mux Configuration for TRIP8">
		<bitfield id="MUX16" description="Mux16 Configuration for TRIP8 of EPWM-XBAR" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="MUX17" description="Mux17 Configuration for TRIP8 of EPWM-XBAR" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="MUX18" description="Mux18 Configuration for TRIP8 of EPWM-XBAR" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="MUX19" description="Mux19 Configuration for TRIP8 of EPWM-XBAR" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="MUX20" description="Mux20 Configuration for TRIP8 of EPWM-XBAR" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="MUX21" description="Mux21 Configuration for TRIP8 of EPWM-XBAR" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="MUX22" description="Mux22 Configuration for TRIP8 of EPWM-XBAR" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="MUX23" description="Mux23 Configuration for TRIP8 of EPWM-XBAR" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="MUX24" description="Mux24 Configuration for TRIP8 of EPWM-XBAR" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="MUX25" description="Mux25 Configuration for TRIP8 of EPWM-XBAR" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="MUX26" description="Mux26 Configuration for TRIP8 of EPWM-XBAR" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="MUX27" description="Mux27 Configuration for TRIP8 of EPWM-XBAR" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="MUX28" description="Mux28 Configuration for TRIP8 of EPWM-XBAR" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="MUX29" description="Mux29 Configuration for TRIP8 of EPWM-XBAR" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="MUX30" description="Mux30 Configuration for TRIP8 of EPWM-XBAR" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="MUX31" description="Mux31 Configuration for TRIP8 of EPWM-XBAR" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
